In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('../iniadMaterial/AI-0102/baseball_shop.csv',delimiter=',', skiprows=0, header=0)
print( df.shape )
print( df.dtypes )
display( df.info() )

(376, 5)
ShopID      int64
Pref       object
Product    object
Price       int64
Amount      int64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB

None

In [3]:
print(df['Pref'].value_counts())
print(df['Product'].value_counts())

Tokyo       68
Kanagawa    68
Chiba       64
Saitama     48
Ibaraki     48
Tochigi     40
Gunma       40
Name: Pref, dtype: int64
SHOES      94
BAT        94
UNIFORM    94
GLOVE      94
Name: Product, dtype: int64

In [4]:
print(len(df['ShopID'].value_counts()))

94

In [5]:
df['Sales'] = df['Price']*df['Amount']
display(df.head())

   ShopID      Pref  Product  Price  Amount   Sales
0      18  Kanagawa      BAT  13800      10  138000
1      18  Kanagawa  UNIFORM  11800      12  141600
2      18  Kanagawa    GLOVE  16700      10  167000
3      18  Kanagawa    SHOES  12800      10  128000
4      30   Ibaraki      BAT  13800       8  110400

In [6]:
print(df['Sales'].sum())

37283200

In [7]:
df_pref = df[['Pref', 'Sales']].groupby('Pref').sum()
# print(df_pref)
print(df_pref)

            Sales
Pref
Chiba     5343100
Gunma     4021000
Ibaraki   4513500
Kanagawa  5813100
Saitama   5276800
Tochigi   3296300
Tokyo     9019400

In [8]:
print( df_pref['Sales'].idxmin() )

Tochigi

In [9]:
df_pivot = df.pivot_table('Sales',index='Pref', columns='Product', aggfunc=np.sum)
display(df_pivot)
print(df_pivot.loc['Chiba']['UNIFORM'])

Product       BAT    GLOVE    SHOES  UNIFORM
Pref
Chiba      966000  1486300  1356800  1534000
Gunma      938400  1402800   960000   719800
Ibaraki   1090200  1152300  1126400  1144600
Kanagawa  1297200  1619900  1574400  1321600
Saitama   1228200  1503000  1318400  1227200
Tochigi    759000   718100   780800  1038400
Tokyo     2166600  2839000  2137600  1876200

1534000

In [24]:
df_shop = df[['ShopID', 'Pref', 'Amount', 'Sales']].groupby(['ShopID', 'Pref']).sum()
df_shop_by_pref = df_shop.groupby(['Pref']).mean()
display(df_shop)
print(df_shop_by_pref)
print(df_shop_by_pref.at['Gunma', 'Sales'])

                 Amount   Sales
ShopID Pref
1      Chiba         20  264700
2      Tokyo         20  294100
3      Chiba         11  148500
4      Saitama       16  215600
5      Ibaraki       24  346200
...                 ...     ...
90     Tokyo         45  620400
91     Ibaraki       24  329600
92     Tochigi       24  319800
93     Kanagawa      27  368100
94     Tokyo         32  439800

[94 rows x 2 columns]

             Amount          Sales
Pref
Chiba     24.687500  333943.750000
Gunma     28.800000  402100.000000
Ibaraki   27.750000  376125.000000
Kanagawa  25.058824  341947.058824
Saitama   32.166667  439733.333333
Tochigi   24.700000  329630.000000
Tokyo     38.411765  530552.941176
402100.0

In [28]:
# print(df['Product'])
# print(df['Product'].map(lambda x: x.lower()))
df['Product'] = df['Product'].map(lambda x: x.lower())
display(df)

     ShopID      Pref  Product  Price  Amount   Sales
0        18  Kanagawa      bat  13800      10  138000
1        18  Kanagawa  uniform  11800      12  141600
2        18  Kanagawa    glove  16700      10  167000
3        18  Kanagawa    shoes  12800      10  128000
4        30   Ibaraki      bat  13800       8  110400
..      ...       ...      ...    ...     ...     ...
371      93  Kanagawa    shoes  12800       7   89600
372      13     Tokyo      bat  13800       8  110400
373      13     Tokyo  uniform  11800      10  118000
374      13     Tokyo    glove  16700       9  150300
375      13     Tokyo    shoes  12800       8  102400

[376 rows x 6 columns]